nexchange/tests/fixtures/transaction_history.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Body>
      <Transaction_HistoryResponse xmlns="https://api.okpay.com">
         <Transaction_HistoryResult xmlns:a="http://schemas.datacontract.org/2004/07/OkPayAPI" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
            <a:PageCount>10</a:PageCount>
            <a:PageNumber>1</a:PageNumber>
            <a:PageSize>10</a:PageSize>
            <a:TotalCount>46</a:TotalCount>
            <a:Transactions>
               <a:TransactionInfo>
                  <a:Amount>85.86</a:Amount>
                  <a:Comment>12345</a:Comment>
                  <a:Currency>EUR</a:Currency>
                  <a:Date>2016-10-30 00:14:50</a:Date>
                  <a:Fees>-0.0100</a:Fees>
                  <a:ID>5755062</a:ID>
                  <a:Invoice/>
                  <a:Net>85.85</a:Net>
                  <a:OperationName>Send Money</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK217536082</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>901218740</a:AccountID>
                     <a:Country_ISO>US</a:Country_ISO>
                     <a:Email>dobbscoin@gmail.com</a:Email>
                     <a:Name>Bob Dobbs</a:Name>
                     <a:VerificationStatus>Unverified</a:VerificationStatus>
                     <a:WalletID>OK487565544</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>85.86</a:Amount>
                  <a:Comment>12345</a:Comment>
                  <a:Currency>EUR</a:Currency>
                  <a:Date>2016-10-30 00:14:50</a:Date>
                  <a:Fees>-0.0100</a:Fees>
                  <a:ID>5755062</a:ID>
                  <a:Invoice/>
                  <a:Net>85.85</a:Net>
                  <a:OperationName>Send Money</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK702746927</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>901218740</a:AccountID>
                     <a:Country_ISO>US</a:Country_ISO>
                     <a:Email>dobbscoin@gmail.com</a:Email>
                     <a:Name>Bob Dobbs</a:Name>
                     <a:VerificationStatus>Unverified</a:VerificationStatus>
                     <a:WalletID>OK487565544</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>-1.0000</a:Amount>
                  <a:Comment/>
                  <a:Currency>USD</a:Currency>
                  <a:Date>2016-10-27 17:53:38</a:Date>
                  <a:Fees>0</a:Fees>
                  <a:ID>5750203</a:ID>
                  <a:Invoice/>
                  <a:Net>-1.0000</a:Net>
                  <a:OperationName>Send Money</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>901218740</a:AccountID>
                     <a:Country_ISO>US</a:Country_ISO>
                     <a:Email>dobbscoin@gmail.com</a:Email>
                     <a:Name>Bob Dobbs</a:Name>
                     <a:VerificationStatus>Unverified</a:VerificationStatus>
                     <a:WalletID>OK487565544</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>100.0000</a:Amount>
                  <a:Comment/>
                  <a:Currency>USD</a:Currency>
                  <a:Date>2016-10-02 05:52:54</a:Date>
                  <a:Fees>0</a:Fees>
                  <a:ID>5695840</a:ID>
                  <a:Invoice>beta_test__1116</a:Invoice>
                  <a:Net>100.0000</a:Net>
                  <a:OperationName>Payment PS</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>565269165</a:AccountID>
                     <a:Country_ISO/>
                     <a:Email>payments@okpay.com</a:Email>
                     <a:Name>OKPAY</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK152752721</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>-9.7000</a:Amount>
                  <a:Comment/>
                  <a:Currency>USD</a:Currency>
                  <a:Date>2016-09-20 20:58:03</a:Date>
                  <a:Fees>-0.3000</a:Fees>
                  <a:ID>5673496</a:ID>
                  <a:Invoice/>
                  <a:Net>-10.0000</a:Net>
                  <a:OperationName>Withdrawal QIWI</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>666146284</a:AccountID>
                     <a:Country_ISO>VG</a:Country_ISO>
                     <a:Email>service@okpay.com</a:Email>
                     <a:Name>OKPAY Inc.</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK194011882</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>-4.8500</a:Amount>
                  <a:Comment/>
                  <a:Currency>USD</a:Currency>
                  <a:Date>2016-09-20 20:53:26</a:Date>
                  <a:Fees>-0.1500</a:Fees>
                  <a:ID>5673486</a:ID>
                  <a:Invoice/>
                  <a:Net>-5.0000</a:Net>
                  <a:OperationName>Withdrawal QIWI</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>666146284</a:AccountID>
                     <a:Country_ISO>VG</a:Country_ISO>
                     <a:Email>service@okpay.com</a:Email>
                     <a:Name>OKPAY Inc.</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK194011882</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>-63.0500</a:Amount>
                  <a:Comment/>
                  <a:Currency>USD</a:Currency>
                  <a:Date>2016-09-20 20:50:25</a:Date>
                  <a:Fees>-1.9500</a:Fees>
                  <a:ID>5673480</a:ID>
                  <a:Invoice/>
                  <a:Net>-65.0000</a:Net>
                  <a:OperationName>Withdrawal QIWI</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>666146284</a:AccountID>
                     <a:Country_ISO>VG</a:Country_ISO>
                     <a:Email>service@okpay.com</a:Email>
                     <a:Name>OKPAY Inc.</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK194011882</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>-1762.4900</a:Amount>
                  <a:Comment/>
                  <a:Currency>RUB</a:Currency>
                  <a:Date>2016-09-20 20:47:33</a:Date>
                  <a:Fees>-54.5100</a:Fees>
                  <a:ID>5673471</a:ID>
                  <a:Invoice/>
                  <a:Net>-1817.0000</a:Net>
                  <a:OperationName>Withdrawal QIWI</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>666146284</a:AccountID>
                     <a:Country_ISO>VG</a:Country_ISO>
                     <a:Email>service@okpay.com</a:Email>
                     <a:Name>OKPAY Inc.</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK194011882</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>-1762.4900</a:Amount>
                  <a:Comment/>
                  <a:Currency>RUB</a:Currency>
                  <a:Date>2016-09-20 20:47:17</a:Date>
                  <a:Fees>-54.5100</a:Fees>
                  <a:ID>5673469</a:ID>
                  <a:Invoice/>
                  <a:Net>-1817.0000</a:Net>
                  <a:OperationName>Withdrawal QIWI</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>666146284</a:AccountID>
                     <a:Country_ISO>VG</a:Country_ISO>
                     <a:Email>service@okpay.com</a:Email>
                     <a:Name>OKPAY Inc.</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK194011882</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Sender>
                  <a:Status>Canceled</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>1767.9700</a:Amount>
                  <a:Comment>0.04656278 BTC Ex 37969.700970 RUB (1BBbn3peN9T528oadFVbTreGeq14D6cHNs)</a:Comment>
                  <a:Currency>RUB</a:Currency>
                  <a:Date>2016-09-20 20:45:44</a:Date>
                  <a:Fees>0</a:Fees>
                  <a:ID>5673402</a:ID>
                  <a:Invoice/>
                  <a:Net>1767.9700</a:Net>
                  <a:OperationName>Deposit Bitcoin</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>666146284</a:AccountID>
                     <a:Country_ISO>VG</a:Country_ISO>
                     <a:Email>service@okpay.com</a:Email>
                     <a:Name>OKPAY Inc.</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK778171326</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
               <a:TransactionInfo>
                  <a:Amount>-1358.0000</a:Amount>
                  <a:Comment/>
                  <a:Currency>RUB</a:Currency>
                  <a:Date>2016-09-20 19:05:31</a:Date>
                  <a:Fees>-42.0000</a:Fees>
                  <a:ID>5673307</a:ID>
                  <a:Invoice/>
                  <a:Net>-1400.0000</a:Net>
                  <a:OperationName>Withdrawal QIWI</a:OperationName>
                  <a:Receiver>
                     <a:AccountID>666146284</a:AccountID>
                     <a:Country_ISO>VG</a:Country_ISO>
                     <a:Email>service@okpay.com</a:Email>
                     <a:Name>OKPAY Inc.</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK194011882</a:WalletID>
                  </a:Receiver>
                  <a:Sender>
                     <a:AccountID>803070022</a:AccountID>
                     <a:Country_ISO>KZ</a:Country_ISO>
                     <a:Email>support@crypto-trade.net</a:Email>
                     <a:Name>Crypto-Trade</a:Name>
                     <a:VerificationStatus>Verified</a:VerificationStatus>
                     <a:WalletID>OK394093862</a:WalletID>
                  </a:Sender>
                  <a:Status>Completed</a:Status>
               </a:TransactionInfo>
            </a:Transactions>
         </Transaction_HistoryResult>
      </Transaction_HistoryResponse>
   </s:Body>
</s:Envelope>

